---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FailureDefinitionRegistry
source: html/85e5ac5f-8f85-8b75-4489-1e7d076d89b8.htm
---
# FailureDefinitionRegistry Members

Releases all resources used by the FailureDefinitionRegistry